In [1]:
from bs4 import BeautifulSoup
import pandas as pd
import requests

In [2]:
page = requests.get('https://sos.ga.gov/elections/election_results/2010_0810/0041701.htm')
soup = BeautifulSoup(page.text, 'html.parser')

In [3]:
table = soup.find_all("table")[2]

In [4]:
df = pd.read_html(str(table), flavor='bs4')

In [5]:
df = df[1]

In [6]:
df.shape

(8, 8)

In [7]:
df.head(5)

        0     1              2                 3               4   5   6   7
0     NaN   NaN  Hilton  7,109  Jeffares  10,708  Totals  17,817 NaN NaN NaN
1     NaN   NaN          39.9%             60.1%          100.0% NaN NaN NaN
2  County   PPR            NaN               NaN             NaN NaN NaN NaN
3   HENRY  100%           1639              5317            6956 NaN NaN NaN
4  NEWTON  100%           3135              2888            6023 NaN NaN NaN

In [8]:
df = df[3:]

In [9]:
df.head(5)

          0     1     2     3     4   5   6   7
3     HENRY  100%  1639  5317  6956 NaN NaN NaN
4    NEWTON  100%  3135  2888  6023 NaN NaN NaN
5  ROCKDALE  100%   611   688  1299 NaN NaN NaN
6  SPALDING  100%   246   456   702 NaN NaN NaN
7    WALTON  100%  1478  1359  2837 NaN NaN NaN

In [10]:
df = df[df.columns[[0,2,3]]]

In [11]:
df.head(5)

          0     2     3
3     HENRY  1639  5317
4    NEWTON  3135  2888
5  ROCKDALE   611   688
6  SPALDING   246   456
7    WALTON  1478  1359

In [12]:
df.columns = ['county', 'Todd Hilton', 'Rick Jeffares']

In [13]:
df.tail(5)

     county Todd Hilton Rick Jeffares
3     HENRY        1639          5317
4    NEWTON        3135          2888
5  ROCKDALE         611           688
6  SPALDING         246           456
7    WALTON        1478          1359

In [14]:
df = df.melt(id_vars=['county'])

In [15]:
df.columns = ['county', 'candidate', 'votes']

In [16]:
df.head()

     county    candidate votes
0     HENRY  Todd Hilton  1639
1    NEWTON  Todd Hilton  3135
2  ROCKDALE  Todd Hilton   611
3  SPALDING  Todd Hilton   246
4    WALTON  Todd Hilton  1478

In [17]:
df['votes'] = df['votes'].astype(int)

In [18]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 3 columns):
county       10 non-null object
candidate    10 non-null object
votes        10 non-null int64
dtypes: int64(1), object(2)
memory usage: 320.0+ bytes

In [19]:
df['office'] = 'State Senate'

In [20]:
df['district'] = '17'

In [21]:
df['party'] = 'Republican'

In [22]:
df.groupby(['candidate', 'party'])['votes'].sum()

candidate      party
Rick Jeffares  Republican    10708
Todd Hilton    Republican     7109
Name: votes, dtype: int64

In [23]:
df[['county', 'office', 'district', 'party', 'candidate', 'votes']].head()

     county        office district       party    candidate  votes
0     HENRY  State Senate       17  Republican  Todd Hilton   1639
1    NEWTON  State Senate       17  Republican  Todd Hilton   3135
2  ROCKDALE  State Senate       17  Republican  Todd Hilton    611
3  SPALDING  State Senate       17  Republican  Todd Hilton    246
4    WALTON  State Senate       17  Republican  Todd Hilton   1478

In [24]:
df[['county', 'office', 'district', 'party', 'candidate', 'votes']].to_clipboard(index=False, sep=',')